Repository: 7i6ht/math2visual
Catalog: backend/app/translations/*/LC_MESSAGES/messages.po
Languages: de

source: Isha's pencil is 22 inches long. If she sharpens two inches off on Monday and two inches on Tuesday, how long will her pencil be then?
de: Ishas Bleistift ist 22 Zoll lang. Wenn sie am Montag zwei Zoll und am Dienstag zwei Zoll abschärft, wie lang wird ihr Bleistift dann sein?

source: Rug A is 8 feet by 4 feet, and Rug B is 5 feet by 7 feet. Which rug should Mrs. Hilt buy if she wants the rug with the biggest area?
de: Teppich A ist 8 Fuß mal 4 Fuß und Teppich B ist 5 Fuß mal 7 Fuß. Welchen Teppich sollte Frau Hilt kaufen, wenn sie den Teppich mit der größten Fläche möchte?

source: Note: Here subtraction is another relationship. The result_container has container_name: Carl have more, and container_type is more.
de: Hinweis: Hier ist Subtraktion eine weitere Beziehung. Der result_container hat container_name: Carl have more, und container_type ist more.

source: Mrs. Hilt has two pennies, two dimes, and two nickels. Jacob has four pennies, one nickel, and one dime. Who has more money?
de: Frau Hilt hat zwei Pennies, zwei Dimes und zwei Nickels. Jacob hat vier Pennies, einen Nickel und einen Dime. Wer hat mehr Geld?

source: Sarah had some trucks. She gave 13 to Jeff, and now she has 38 trucks left. How many trucks did Sarah have to start with?
de: Sarah hatte einige Lastwagen. Sie gab 13 an Jeff, und jetzt hat sie noch 38 Lastwagen. Wie viele Lastwagen hatte Sarah am Anfang?

source: A game spinner has 5 equal parts. Two parts are blue and three parts are purple. Which color would you most likely spin?
de: Ein Spielkreisel hat 5 gleich große Teile. Zwei Teile sind blau und drei Teile sind lila. Welche Farbe würden Sie am wahrscheinlichsten drehen?

source: Mrs. Snyder made 86 heart cookies. She made 36 red cookies and the rest are pink. How many pink cookies did she make?
de: Frau Snyder backte 86 Herz-Kekse. Sie backte 36 rote Kekse und der Rest ist rosa. Wie viele rosa Kekse hat sie gebacken?

source: Mrs. Hilt spent 25 cents on one caramel apple and 15 cents on one ice cream cone. How much more did the apple cost?
de: Frau Hilt gab 25 Cent für einen Karamellapfel und 15 Cent für eine Eistüte aus. Wie viel mehr hat der Apfel gekostet?

source: Tessa has 4 apples. Anita gave her 5 more. She needs 10 apples to make a pie. Does she have enough to make a pie?
de: Tessa hat 4 Äpfel. Anita gab ihr 5 weitere. Sie braucht 10 Äpfel, um einen Kuchen zu backen. Hat sie genug, um einen Kuchen zu backen?

source: Mrs. Hilt bought a yoyo for 24 cents and a whistle for 14 cents. How much did she spend in all for the two toys?
de: Frau Hilt kaufte ein Jojo für 24 Cent und eine Pfeife für 14 Cent. Wie viel hat sie insgesamt für die beiden Spielzeuge ausgegeben?

source: Mrs. Hilt bought 6 hot dogs. Each hot dog cost 50 cents. How much money did she pay for all of the hot dogs?
de: Frau Hilt kaufte 6 Hot Dogs. Jeder Hot Dog kostete 50 Cent. Wie viel Geld hat sie für alle Hot Dogs bezahlt?

source: John's birthday is January 20th. His sister's birthday comes 14 days later. When is his sister's birthday?
de: Johns Geburtstag ist der 20. Januar. Der Geburtstag seiner Schwester ist 14 Tage später. Wann ist der Geburtstag seiner Schwester?

source: Karen wants to buy a pen that costs 75 cents. She has 2 quarters and 3 dimes. Does she have enough money?
de: Karen möchte einen Stift kaufen, der 75 Cent kostet. Sie hat 2 Vierteldollars und 3 Dimes. Hat sie genug Geld?

source: Note: Here surplus is another relationship, we compute the surplus of container1 divided by container2.
de: Hinweis: Hier ist surplus eine weitere Beziehung, wir berechnen den Rest von container1 geteilt durch container2.

source: If Carl has a total of 89 stamps and Kevin has 57, how many more stamps does Carl have more than Kevin?
de: Wenn Carl insgesamt 89 Briefmarken hat und Kevin 57, wie viele Briefmarken hat Carl mehr als Kevin?

source: Marin has nine apples and Donald has two apples. How many apples do Marin and Donald have together?
de: Marin hat neun Äpfel und Donald hat zwei Äpfel. Wie viele Äpfel haben Marin und Donald zusammen?

source: Note: its ok if we use the container name the same as name if the name itself is distinguishable.
de: Hinweis: Es ist in Ordnung, wenn wir den Containernamen gleich wie den Namen verwenden, wenn der Name selbst unterscheidbar ist.

source: Mrs. Hilt bought 3 pizzas for $8 each. What was the total amount she paid for the three pizzas?
de: Frau Hilt kaufte 3 Pizzen für jeweils 8 Dollar. Wie viel hat sie insgesamt für die drei Pizzen bezahlt?

source: Roden went to a pet shop. He bought 15 gold fish and 7 blue fish. How many fish did he buy?
de: Roden ging in eine Zoohandlung. Er kaufte 15 Goldfische und 7 blaue Fische. Wie viele Fische hat er gekauft?

source: Ellen has six more balls than Marin. Marin has nine balls. How many balls does Ellen have?
de: Ellen hat sechs Bälle mehr als Marin. Marin hat neun Bälle. Wie viele Bälle hat Ellen?

source: Note: here we need to use heart-cookie because its visual is different with normal cookie
de: Hinweis: Hier müssen wir heart-cookie verwenden, da seine visuelle Darstellung sich von normalen Keksen unterscheidet

source: Note: For those difference problem, we still use subtraction relationship to express it.
de: Hinweis: Für solche Differenzprobleme verwenden wir weiterhin die Subtraktionsbeziehung, um sie auszudrücken.

source: Mrs. Hilt bought an ice cream cone for 99 cents. How much would 2 ice cream cones cost?
de: Frau Hilt kaufte eine Eistüte für 99 Cent. Wie viel würden 2 Eistüten kosten?

source: The Hawks scored three touchdowns worth 7 points each. How many points do they have?
de: Die Hawks erzielten drei Touchdowns im Wert von jeweils 7 Punkten. Wie viele Punkte haben sie?

source: Note: If the item is some color part, you can refer it as color-part, like red-part.
de: Hinweis: Wenn das Element ein farbiger Teil ist, können Sie es als color-part bezeichnen, wie red-part.

source: Note: we need to distinguish different fish here because their visual are different
de: Hinweis: Wir müssen hier verschiedene Fische unterscheiden, da ihre visuelle Darstellung unterschiedlich ist

source: If you have 1 ten dollar bill, 1 quarter and 1 nickel, how much money do you have?
de: Wenn Sie einen 10-Dollar-Schein, eine 25-Cent-Münze und eine 5-Cent-Münze haben, wie viel Geld haben Sie?

source: Note: here is another example, the name and type always point to same thing.
de: Hinweis: Hier ist ein weiteres Beispiel, der Name und Typ zeigen immer auf dasselbe.

source: We first provide you several example, please understand the logic clearly:
de: Wir geben Ihnen zunächst mehrere Beispiele, bitte verstehen Sie die Logik klar:

source: Good, now try to understand the above requirement step by step.
de: Gut, versuchen Sie nun, die obige Anforderung Schritt für Schritt zu verstehen.

source: You should use the following fixed format for each problem:
de: Sie sollten das folgende feste Format für jedes Problem verwenden:

source: A quarter equals $0.25. How many quarters equal $2.25?
de: Eine 25-Cent-Münze entspricht 0,25 Dollar. Wie viele 25-Cent-Münzen entsprechen 2,25 Dollar?

source: Note: can emphasize 'left' for this type of question.
de: Hinweis: kann 'left' für diese Art von Frage betonen.

source: Background information
de: Hintergrundinformationen

source: Additional hints:
de: Zusätzliche Hinweise:

source: Question:
de: Frage:

source: Formula:
de: Formel:

source: Examples
de: Beispiele

source: Task
de: Aufgabe
