Repository: 7i6ht/math2visual
Catalog: backend/app/translations/*/LC_MESSAGES/messages.po
Languages: de

source: Not found
de: Nicht gefunden

source: Bad request
de: Ungültige Anfrage

source: Internal server error
de: Interner Serverfehler

source: Request too large
de: Anfrage zu groß

source: Empty Visual Language provided.
de: Leere visuelle Sprache bereitgestellt.

source: Please provide a math word problem (MWP).
de: Bitte geben Sie eine Mathe-Textaufgabe ein.

source: Did not get Visual Language from AI. Please try again.
de: Visuelle Sprache konnte nicht von der KI erhalten werden. Bitte versuchen Sie es erneut.

source: Visual Language parse error.
de: Fehler beim Parsen der visuellen Sprache.

source: Could not generate formal visualization: %(error)s
de: Formale Visualisierung konnte nicht generiert werden: %(error)s

source: Could not generate formal visualization. Retrying might help.
de: Formale Visualisierung konnte nicht generiert werden. Ein erneuter Versuch könnte helfen.

source: Formal generation error: %(error)s
de: Fehler bei der formalen Generierung: %(error)s

source: Unexpected formal generation error: %(error)s
de: Unerwarteter Fehler bei der formalen Generierung: %(error)s

source: Could not generate intuitive visualization: %(error)s
de: Intuitive Visualisierung konnte nicht generiert werden: %(error)s

source: Could not generate intuitive visualization. Retrying might help.
de: Intuitive Visualisierung konnte nicht generiert werden. Ein erneuter Versuch könnte helfen.

source: Intuitive generation error: %(error)s
de: Fehler bei der intuitiven Generierung: %(error)s

source: Unexpected intuitive generation error: %(error)s
de: Unerwarteter Fehler bei der intuitiven Generierung: %(error)s

source: SVG dataset directory not found
de: SVG-Datensatz-Verzeichnis nicht gefunden

source: Permission denied accessing SVG dataset
de: Zugriff auf SVG-Datensatz verweigert

source: Search failed: %(error)s
de: Suche fehlgeschlagen: %(error)s

source: Request too large (max 10MB)
de: Anfrage zu groß (max. 10MB)

source: No file uploaded
de: Keine Datei hochgeladen

source: Expected filename not provided
de: Erwarteter Dateiname nicht angegeben

source: No file selected
de: Keine Datei ausgewählt

source: File already exists or has been added by another user in the meantime: %(filename)s
de: Datei existiert bereits oder wurde in der Zwischenzeit von einem anderen Benutzer hinzugefügt: %(filename)s

source: SVG file uploaded successfully: %(filename)s
de: SVG-Datei erfolgreich hochgeladen: %(filename)s

source: Upload failed: %(error)s
de: Upload fehlgeschlagen: %(error)s

source: Name parameter is required
de: Name-Parameter ist erforderlich

source: Check failed: %(error)s
de: Prüfung fehlgeschlagen: %(error)s

source: Only SVG files are allowed
de: Nur SVG-Dateien sind erlaubt

source: File not found
de: Datei nicht gefunden

source: File not accessible
de: Datei nicht zugänglich

source: Empty file
de: Leere Datei

source: Failed to serve file: %(error)s
de: Datei konnte nicht bereitgestellt werden: %(error)s

source: Entity type is required
de: Entitätstyp ist erforderlich

source: Failed to generate SVG
de: SVG konnte nicht generiert werden

source: Generated SVG validation failed: %(error)s
de: Validierung des generierten SVG fehlgeschlagen: %(error)s

source: SVG icon generated successfully: %(entity_type)s
de: SVG-Icon erfolgreich generiert: %(entity_type)s

source: Generation failed: %(error)s
de: Generierung fehlgeschlagen: %(error)s

source: Temporary filename is required
de: Temporärer Dateiname ist erforderlich

source: Invalid filename
de: Ungültiger Dateiname

source: Temporary file not found
de: Temporäre Datei nicht gefunden

source: File already exists in dataset: %(filename)s
de: Datei existiert bereits im Datensatz: %(filename)s

source: SVG added to dataset: %(filename)s
de: SVG zum Datensatz hinzugefügt: %(filename)s

source: Confirmation of temporary SVG failed: %(error)s
de: Bestätigung des temporären SVG fehlgeschlagen: %(error)s

source: Failed to get storage status: %(error)s
de: Speicherstatus konnte nicht abgerufen werden: %(error)s

source: Failed to get antivirus status: %(error)s
de: Antivirus-Status konnte nicht abgerufen werden: %(error)s

source: Note: Here addition describe the computation relationship between container1 and container2. We choose the entity as the thing corresponding to quantity, so the quantity is describing that entity. "entity_type" represent entity's visual representation name while "entity_name" is its apparent name. Like a boy has name Bob, so "entity_name" is Bob, "entity_type" is boy because we visualize he as a boy. container_name and container_type represent an attribute that you think is necessary in this question and we will make this attribute as the container of this entity to show a ownership relation, only add it if you think it do not cause confusion. If all entity share same container, please only give "container_name" and "container_type" value to result_container and leave other container blank. Only give value to attr_type, attr_name if you found "container_name" and "container_type" is not enough so we provide one more attribute to identify this entity. The result_container describe the result of this computation, their entity_name usually is the same as container1 and container2, their entity_quantity is the computation result, their container_name and container_type describe the container of the final result.
de: Hinweis: Hier beschreibt addition die Berechnungsbeziehung zwischen container1 und container2. Wir wählen die Entität als das der Menge entsprechende Ding, daher beschreibt die Menge diese Entität. "entity_type" stellt den visuellen Darstellungsnamen der Entität dar, während "entity_name" ihr offensichtlicher Name ist. Wie ein Junge den Namen Bob hat, so ist "entity_name" Bob, "entity_type" ist boy, weil wir ihn als Jungen visualisieren. container_name und container_type stellen ein Attribut dar, das Sie für notwendig halten, und wir machen dieses Attribut zum Container dieser Entität, um eine Besitzbeziehung zu zeigen, fügen Sie es nur hinzu, wenn Sie denken, dass es keine Verwirrung verursacht. Wenn alle Entitäten denselben Container teilen, geben Sie bitte nur "container_name" und "container_type" Wert an result_container und lassen Sie andere Container leer. Geben Sie nur Wert für attr_type, attr_name an, wenn Sie feststellen, dass "container_name" und "container_type" nicht ausreichen, damit wir ein weiteres Attribut bereitstellen, um diese Entität zu identifizieren. Der result_container beschreibt das Ergebnis dieser Berechnung, ihr entity_name ist normalerweise derselbe wie container1 und container2, ihre entity_quantity ist das Berechnungsergebnis, ihr container_name und container_type beschreiben den Container des Endergebnisses.

source: Each entity has the attributes: entity_name, entity_type, entity_quantity, container_name, container_type, attr_name, attr_type. Name and type are different, for example, a girl named Lucy may be represented by entity_name: Lucy, entity_type: girl. The attributes container_name, container_type, attr_name and attr_type are optional and may vary according to different interpretations, only use them if you think they are necessary to clarify the entity.
de: Jede Entität hat die Attribute: entity_name, entity_type, entity_quantity, container_name, container_type, attr_name, attr_type. Name und Typ sind unterschiedlich, zum Beispiel kann ein Mädchen namens Lucy durch entity_name: Lucy, entity_type: girl dargestellt werden. Die Attribute container_name, container_type, attr_name und attr_type sind optional und können je nach Interpretation variieren, verwenden Sie sie nur, wenn Sie denken, dass sie notwendig sind, um die Entität zu klären.

source: It is Buddy's first day at a new school and he is feeling very nervous. His day begins with some bacon and egg prepared by his mother. After eating and preparing, Buddy headed out to catch the school bus from the nearest bus stop. Including Buddy, there were 39 students that got on the bus during the first stop. If 29 more students got on the bus at the second stop, how many students are riding the bus?
de: Es ist Buddys erster Tag an einer neuen Schule und er ist sehr nervös. Sein Tag beginnt mit Speck und Eiern, die seine Mutter zubereitet hat. Nach dem Essen und Vorbereiten machte sich Buddy auf den Weg, um den Schulbus von der nächsten Bushaltestelle zu nehmen. Einschließlich Buddy stiegen 39 Schüler am ersten Halt in den Bus. Wenn am zweiten Halt 29 weitere Schüler in den Bus steigen, wie viele Schüler fahren im Bus?

source: Note: Here the entity_name is point instead of touchdown because the quantity 7 is corresponding to point not touchdown, and we put touchdown in container as it owns these points. You can imagine multiplication as we repeat one box multiple times, here the box is touchdown and points are item inside each box. And finally Hawks is the container of the result_container as it owns all the box.
de: Hinweis: Hier ist entity_name point anstatt touchdown, weil die Menge 7 point entspricht, nicht touchdown, und wir setzen touchdown in container, da es diese Punkte besitzt. Sie können sich Multiplikation vorstellen, als würden wir eine Box mehrmals wiederholen, hier ist die Box touchdown und Punkte sind Elemente in jeder Box. Und schließlich ist Hawks der Container des result_container, da es alle Boxen besitzt.

source: Note: In this case, if the attr is a name of a day of the week(Monday,Sunday, yesterday, tomorrow...) or a year or a month, we can use calendar as type to visualize it. Similar if its a time, we can use clock as type. And for inch or other length, we can use measure as type. The last result_container should use the overall container of this item, like pencil here.
de: Hinweis: In diesem Fall, wenn das attr ein Name eines Wochentags (Montag, Sonntag, gestern, morgen...) oder ein Jahr oder ein Monat ist, können wir calendar als Typ verwenden, um es zu visualisieren. Ähnlich, wenn es eine Zeit ist, können wir clock als Typ verwenden. Und für Zoll oder andere Längen können wir measure als Typ verwenden. Der letzte result_container sollte den Gesamtcontainer dieses Elements verwenden, wie hier pencil.

source: Good, now try to understand the above requirement step by step. I also provide you with the formula of this question, your visual_language should adapt to this formula, for example, if the formula is multiple addition instead of multiplication, you should use multiple addition.
de: Gut, versuchen Sie nun, die obige Anforderung Schritt für Schritt zu verstehen. Ich gebe Ihnen auch die Formel dieser Frage, Ihre visual_language sollte sich an diese Formel anpassen, zum Beispiel, wenn die Formel mehrere Additionen anstatt Multiplikation ist, sollten Sie mehrere Additionen verwenden.

source: "area" is computing the area value by its two input entities, the container1 represent length while container2 represents width as indicated by container, name is unit. The container_name and container_type of result_container indicate the item this area belong to.
de: "area" berechnet den Flächenwert durch seine beiden Eingabeentitäten, container1 stellt die Länge dar, während container2 die Breite darstellt, wie durch container angegeben, name ist die Einheit. Der container_name und container_type von result_container zeigen das Element an, zu dem diese Fläche gehört.

source: At the top of the Empire State Building, he saw the Madison Square Garden so he decided to go there as well. It took him 676 steps to get down the building and 315 steps from the building to Madison Square Garden. How many steps did he take to get to Madison Square?
de: Oben im Empire State Building sah er den Madison Square Garden und beschloss, auch dorthin zu gehen. Es dauerte 676 Schritte, um das Gebäude hinunterzugehen, und 315 Schritte vom Gebäude zum Madison Square Garden. Wie viele Schritte machte er, um zum Madison Square zu gelangen?

source: Note: Here unittrans means unit transformation, it is another relationship between entity and its unittrans_value. Like in this example, a ten-dollar-bill have value of 10 dollars, so the name of container2 is dollar, the type is unittrans_value, and quantity is 10.
de: Hinweis: Hier bedeutet unittrans Einheitentransformation, es ist eine weitere Beziehung zwischen Entität und ihrem unittrans_value. Wie in diesem Beispiel hat ein 10-Dollar-Schein einen Wert von 10 Dollar, daher ist der Name von container2 dollar, der Typ ist unittrans_value und die Menge ist 10.

source: In the math word problem description ``Jake picked up three apples in the morning...'' the container1 could be specified as entity_name: apple, entity_type: apple, entity_quantity: 3, container_name: Jake, container_type: boy, attr_name: morning, attr_type: morning.
de: In der Beschreibung der mathematischen Textaufgabe ``Jake sammelte morgens drei Äpfel auf...'' könnte container1 als entity_name: apple, entity_type: apple, entity_quantity: 3, container_name: Jake, container_type: boy, attr_name: morning, attr_type: morning angegeben werden.

source: Note: When there are continuous subtractions, please always use subtraction relationship. In general try to use fewer kinds of relationship to represent the question. And here, the entity_name and entity_type should distinguish history book and geography book.
de: Hinweis: Wenn es kontinuierliche Subtraktionen gibt, verwenden Sie bitte immer die Subtraktionsbeziehung. Versuchen Sie im Allgemeinen, weniger Arten von Beziehungen zu verwenden, um die Frage darzustellen. Und hier sollten entity_name und entity_type Geschichtsbuch und Geographiebuch unterscheiden.

source: Note: Here comparison and area are two new relationships. "comparison" comparing the quantity of two entity, the two entity can be the result of other computation like in this example, the name of result_container indicate the comparison result.
de: Hinweis: Hier sind comparison und area zwei neue Beziehungen. "comparison" vergleicht die Menge von zwei Entitäten, die beiden Entitäten können das Ergebnis anderer Berechnungen sein, wie in diesem Beispiel, der Name von result_container zeigt das Vergleichsergebnis an.

source: To add support on the house's connections, he decided to tie the wood joints with rope. He needs 185 feet of rope. If he has 46 feet of rope with him and at the moment he only needed 57 feet, how many feet of rope did his friends give to him?
de: Um die Verbindungen des Hauses zu verstärken, beschloss er, die Holzverbindungen mit Seil zu binden. Er braucht 185 Fuß Seil. Wenn er 46 Fuß Seil bei sich hat und im Moment nur 57 Fuß brauchte, wie viele Fuß Seil gaben ihm seine Freunde?

source: Note: here the divider is the box, so the result_container has container paper clips per box. If the question is about fixing the number of paper clip per box and asking how many boxes, then the result_container should have container as box.
de: Hinweis: Hier ist der Divisor die Schachtel, daher hat der result_container container paper clips per box. Wenn die Frage darum geht, die Anzahl der Büroklammern pro Schachtel festzulegen und zu fragen, wie viele Schachteln, dann sollte der result_container container als box haben.

source: Note: This example show we can nesting relationship to express multiple relationships. We write computation in time series order, and as pet center represent the total results, we only put it as the container of the last result_container.
de: Hinweis: Dieses Beispiel zeigt, dass wir Beziehungen verschachteln können, um mehrere Beziehungen auszudrücken. Wir schreiben die Berechnung in zeitlicher Reihenfolge, und da das Tierheim die Gesamtergebnisse darstellt, setzen wir es nur als Container des letzten result_container.

source: Note: here is an example of continuous subtraction, we should try to use less relationship like here we only use multiple subtractions instead of using subtraction and addition, notice each single computation has one result_container.
de: Hinweis: Hier ist ein Beispiel für kontinuierliche Subtraktion, wir sollten versuchen, weniger Beziehungen zu verwenden, wie hier verwenden wir nur mehrere Subtraktionen anstatt Subtraktion und Addition, beachten Sie, dass jede einzelne Berechnung einen result_container hat.

source: Note: please make sure the container name is representative of the current state like in this example, make it distinguishable. Also if the formula is given, make sure the visual langauge is align with the formula, do not skip steps.
de: Hinweis: Bitte stellen Sie sicher, dass der Containername repräsentativ für den aktuellen Zustand ist, wie in diesem Beispiel, machen Sie ihn unterscheidbar. Auch wenn die Formel gegeben ist, stellen Sie sicher, dass die visuelle Sprache mit der Formel übereinstimmt, überspringen Sie keine Schritte.

source: During recess, Buddy went to the cafeteria where he met other students from different grades. If he met 14 second grade students, 10 fourth grade students and 16 fifth grade students, how many students did Buddy meet during recess?
de: Während der Pause ging Buddy in die Cafeteria, wo er andere Schüler aus verschiedenen Klassenstufen traf. Wenn er 14 Zweitklässler, 10 Viertklässler und 16 Fünftklässler traf, wie viele Schüler traf Buddy während der Pause?

source: After the mountain country, she went to the famous beach on the continent. There, she collected 291 seashells of different colors. If she has 76 red shells and 49 green shells, how many shells are not red or green?
de: Nach dem Bergland ging sie zum berühmten Strand auf dem Kontinent. Dort sammelte sie 291 Muscheln in verschiedenen Farben. Wenn sie 76 rote Muscheln und 49 grüne Muscheln hat, wie viele Muscheln sind weder rot noch grün?

source: Lexie's younger brother helped pick up all the paper clips in Lexie's room. He was able to collect 21 paper clips. If he wants to distribute the paper clips in 3 boxes, how many paper clips will each box contain?
de: Lexies jüngerer Bruder half dabei, alle Büroklammern in Lexies Zimmer aufzusammeln. Er konnte 21 Büroklammern sammeln. Wenn er die Büroklammern auf 3 Schachteln verteilen möchte, wie viele Büroklammern wird jede Schachtel enthalten?

source: Once you are ready, you can do the task of converting, you can write down your thinking procedure but please make sure to give me the final visual language of the following question in this format in the end: visual_language:<the visual language result>
de: Sobald Sie bereit sind, können Sie die Aufgabe der Umwandlung durchführen, Sie können Ihren Denkprozess aufschreiben, aber bitte stellen Sie sicher, dass Sie mir am Ende die endgültige visuelle Sprache der folgenden Frage in diesem Format geben: visual_language:<das Resultat für die visuelle Sprache>

source: Another material that he needs is rope. If he already has 6 feet of rope and he needs additional ropes having 5 times the length of what he already have, how long should be the additional rope?
de: Ein weiteres Material, das er braucht, ist Seil. Wenn er bereits 6 Fuß Seil hat und zusätzliche Seile mit der 5-fachen Länge dessen braucht, was er bereits hat, wie lang sollte das zusätzliche Seil sein?

source: There were 36 dogs and 29 cats in a pet center. After 20 of the dogs were adopted by people, the pet center collected another 12 cats. How many pets were there in the pet center in the end?
de: Es gab 36 Hunde und 29 Katzen in einem Tierheim. Nachdem 20 der Hunde von Menschen adoptiert wurden, nahm das Tierheim weitere 12 Katzen auf. Wie viele Haustiere waren am Ende im Tierheim?

source: Note: the name and type always corresponding to the questioned item, like here we should use people not group or member, and container is the thing distinguish the belonging of items.
de: Hinweis: Der Name und Typ entsprechen immer dem fraglichen Element, wie hier sollten wir people verwenden, nicht group oder member, und container ist das, was die Zugehörigkeit der Elemente unterscheidet.

source: You are an expert at converting math story problem into a structured 'visual language'. Your task is to write a visual language expression based on the given math word problem.
de: Sie sind ein Experte für die Umwandlung von mathematischen Textaufgaben in eine strukturierte 'visuelle Sprache'. Ihre Aufgabe ist es, einen visuellen Sprachausdruck basierend auf der gegebenen mathematischen Textaufgabe zu schreiben.

source: Note: In this case, the added results are the balls Ellen has, so we do not add Ellen in the container of container2 because it will cause the confusion that Ellen own 6 balls.
de: Hinweis: In diesem Fall sind die addierten Ergebnisse die Bälle, die Ellen hat, daher fügen wir Ellen nicht in den Container von container2 ein, da dies die Verwirrung verursachen würde, dass Ellen 6 Bälle besitzt.

source: Katie spent a total $350.00 on her whole stay in the island. If she spent $125.00 on food and $135.00 on hotel rooms, how much did she spend on buying other stuff?
de: Katie gab insgesamt 350,00 Dollar für ihren gesamten Aufenthalt auf der Insel aus. Wenn sie 125,00 Dollar für Essen und 135,00 Dollar für Hotelzimmer ausgab, wie viel gab sie für den Kauf anderer Dinge aus?

source: There are 10 books on a shelf. 3 of them are history books, 5 of them are geography books and the rest are math books. How many math books are there on the shelf?
de: Es gibt 10 Bücher im Regal. 3 davon sind Geschichtsbücher, 5 sind Geographiebücher und der Rest sind Mathebücher. Wie viele Mathebücher sind im Regal?

source: An airline has 41 pieces of luggage to put away. If each luggage compartment will hold 5 pieces of luggage, how many will be in the compartment that isn't full?
de: Eine Fluggesellschaft hat 41 Gepäckstücke zu verstauen. Wenn jedes Gepäckfach 5 Gepäckstücke fasst, wie viele werden in dem Fach sein, das nicht voll ist?

source: Note: Here multiplication is another relationship. And row/column is necessary in visual representation so we put it in container_name and container_type
de: Hinweis: Hier ist Multiplikation eine weitere Beziehung. Und Zeile/Spalte ist in der visuellen Darstellung notwendig, daher setzen wir es in container_name und container_type.

source: If Lizzie's group is composed of 54 people and they have 17 more members than the other group, how many people are working together to clean the city?
de: Wenn Lizzies Gruppe aus 54 Personen besteht und sie 17 Mitglieder mehr als die andere Gruppe haben, wie viele Personen arbeiten zusammen, um die Stadt zu säubern?

source: Note: for this type of 'x times of' question, you should use multiplication operation, and the container2 should be have name and type == multiplier.
de: Hinweis: Für diese Art von 'x mal' Frage sollten Sie die Multiplikationsoperation verwenden, und container2 sollte name und type == multiplier haben.

source: Mrs. Santiago has 58 red roses. Mrs. Garrett has 24. What's the difference of the number of Mrs. Santiago's red roses and Mrs. Garrett's red roses?
de: Frau Santiago hat 58 rote Rosen. Frau Garrett hat 24. Wie groß ist der Unterschied zwischen der Anzahl der roten Rosen von Frau Santiago und den roten Rosen von Frau Garrett?

source: For the fifth grade play, the chairs have been put into 27 rows with 16 chairs in each row. How many chairs have been put out for the play?
de: Für das Theaterstück der fünften Klasse wurden die Stühle in 27 Reihen mit jeweils 16 Stühlen aufgestellt. Wie viele Stühle wurden für das Theaterstück aufgestellt?

source: operation can be ``addition'', ``subtraction'', ``multiplication'', ``division'', ``surplus'', ``area'', ``comparison'', or ``unittrans''.
de: operation kann ``addition'', ``subtraction'', ``multiplication'', ``division'', ``surplus'', ``area'', ``comparison'' oder ``unittrans'' sein.
